In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('application_data.csv')
data= data.sample(10000)
data.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
151508,275620,0,Cash loans,M,N,Y,0,270000.0,188685.0,16272.0,...,0,0,0,0,0.0,0.0,0.0,0.0,1.0,2.0
170655,297780,0,Cash loans,F,Y,Y,0,202500.0,194922.0,15214.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,3.0
197480,328961,1,Cash loans,M,Y,N,0,166500.0,450000.0,20979.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,4.0
306253,454829,0,Cash loans,M,Y,Y,0,157500.0,616923.0,48870.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,4.0
74503,186395,0,Cash loans,M,Y,Y,0,450000.0,1437723.0,76729.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,5.0

In [3]:
data.drop(["CODE_GENDER","FLAG_OWN_CAR","FLAG_OWN_REALTY","CNT_CHILDREN","NAME_EDUCATION_TYPE","NAME_FAMILY_STATUS",
         "NAME_HOUSING_TYPE","REGION_POPULATION_RELATIVE","DAYS_BIRTH","DAYS_EMPLOYED","DAYS_REGISTRATION","DAYS_ID_PUBLISH","OWN_CAR_AGE","FLAG_MOBIL",
         "FLAG_EMP_PHONE","FLAG_WORK_PHONE","FLAG_CONT_MOBILE","FLAG_PHONE","FLAG_EMAIL","FLAG_EMAIL","CNT_FAM_MEMBERS","REGION_RATING_CLIENT",
         "REGION_RATING_CLIENT_W_CITY","REG_REGION_NOT_LIVE_REGION","REG_REGION_NOT_WORK_REGION","NAME_TYPE_SUITE",
         "LIVE_REGION_NOT_WORK_REGION","REG_CITY_NOT_LIVE_CITY","REG_CITY_NOT_WORK_CITY","LIVE_CITY_NOT_WORK_CITY"],axis=1,inplace=True)
data.drop(['FONDKAPREMONT_MODE', 'HOUSETYPE_MODE',
       'WALLSMATERIAL_MODE', 'EMERGENCYSTATE_MODE', 'OBS_30_CNT_SOCIAL_CIRCLE',
       'DEF_30_CNT_SOCIAL_CIRCLE', 'OBS_60_CNT_SOCIAL_CIRCLE',
       'DEF_60_CNT_SOCIAL_CIRCLE', 'DAYS_LAST_PHONE_CHANGE', 'FLAG_DOCUMENT_2',
       'FLAG_DOCUMENT_3', 'FLAG_DOCUMENT_4', 'FLAG_DOCUMENT_5',
       'FLAG_DOCUMENT_6', 'FLAG_DOCUMENT_7', 'FLAG_DOCUMENT_8',
       'FLAG_DOCUMENT_9', 'FLAG_DOCUMENT_10', 'FLAG_DOCUMENT_11',
       'FLAG_DOCUMENT_12', 'FLAG_DOCUMENT_13', 'FLAG_DOCUMENT_14',
       'FLAG_DOCUMENT_15', 'FLAG_DOCUMENT_16', 'FLAG_DOCUMENT_17',
       'FLAG_DOCUMENT_18', 'FLAG_DOCUMENT_19', 'FLAG_DOCUMENT_20',
       'FLAG_DOCUMENT_21', 'AMT_REQ_CREDIT_BUREAU_HOUR','AMT_REQ_CREDIT_BUREAU_DAY', 'AMT_REQ_CREDIT_BUREAU_WEEK',
       'AMT_REQ_CREDIT_BUREAU_MON', 'AMT_REQ_CREDIT_BUREAU_QRT',
'AMT_REQ_CREDIT_BUREAU_YEAR'],axis=1,inplace=True)

In [6]:
data.shape

(10000, 58)

In [7]:
data.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,AMT_GOODS_PRICE,NAME_INCOME_TYPE,OCCUPATION_TYPE,WEEKDAY_APPR_PROCESS_START,...,ELEVATORS_MEDI,ENTRANCES_MEDI,FLOORSMAX_MEDI,FLOORSMIN_MEDI,LANDAREA_MEDI,LIVINGAPARTMENTS_MEDI,LIVINGAREA_MEDI,NONLIVINGAPARTMENTS_MEDI,NONLIVINGAREA_MEDI,TOTALAREA_MODE
151508,275620,0,Cash loans,270000.0,188685.0,16272.0,157500.0,Commercial associate,Laborers,SATURDAY,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
170655,297780,0,Cash loans,202500.0,194922.0,15214.5,157500.0,Working,Laborers,FRIDAY,...,0.0,0.2069,0.1667,0.2083,0.071,0.0684,0.0769,0.0078,0.0161,0.0629
197480,328961,1,Cash loans,166500.0,450000.0,20979.0,450000.0,Working,Laborers,THURSDAY,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
306253,454829,0,Cash loans,157500.0,616923.0,48870.0,558000.0,Working,Managers,WEDNESDAY,...,NaN,0.2069,0.1667,NaN,NaN,NaN,NaN,NaN,NaN,0.0821
74503,186395,0,Cash loans,450000.0,1437723.0,76729.5,1372500.0,Commercial associate,Managers,WEDNESDAY,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
data.drop(['EXT_SOURCE_1', 'EXT_SOURCE_2', 'EXT_SOURCE_3', 'APARTMENTS_AVG',
       'BASEMENTAREA_AVG', 'YEARS_BEGINEXPLUATATION_AVG', 'YEARS_BUILD_AVG',
       'COMMONAREA_AVG', 'ELEVATORS_AVG', 'ENTRANCES_AVG', 'FLOORSMAX_AVG',
       'FLOORSMIN_AVG', 'LANDAREA_AVG', 'LIVINGAPARTMENTS_AVG','NAME_CONTRACT_TYPE',
       'LIVINGAREA_AVG', 'NONLIVINGAPARTMENTS_AVG', 'NONLIVINGAREA_AVG',
       'APARTMENTS_MODE', 'BASEMENTAREA_MODE', 'YEARS_BEGINEXPLUATATION_MODE',
       'YEARS_BUILD_MODE', 'COMMONAREA_MODE', 'ELEVATORS_MODE','WEEKDAY_APPR_PROCESS_START',
       'ENTRANCES_MODE', 'FLOORSMAX_MODE', 'FLOORSMIN_MODE', 'LANDAREA_MODE',
       'LIVINGAPARTMENTS_MODE', 'LIVINGAREA_MODE', 'NONLIVINGAPARTMENTS_MODE',
       'NONLIVINGAREA_MODE', 'APARTMENTS_MEDI', 'BASEMENTAREA_MEDI','OCCUPATION_TYPE',
       'YEARS_BEGINEXPLUATATION_MEDI', 'YEARS_BUILD_MEDI', 'COMMONAREA_MEDI',
       'ELEVATORS_MEDI', 'ENTRANCES_MEDI', 'FLOORSMAX_MEDI', 'FLOORSMIN_MEDI',
       'LANDAREA_MEDI', 'LIVINGAPARTMENTS_MEDI', 'LIVINGAREA_MEDI',
       'NONLIVINGAPARTMENTS_MEDI', 'NONLIVINGAREA_MEDI', 'TOTALAREA_MODE'],axis=1,inplace=True)

data.head()

,SK_ID_CURR,TARGET,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,AMT_GOODS_PRICE,NAME_INCOME_TYPE,HOUR_APPR_PROCESS_START,ORGANIZATION_TYPE
151508,275620,0,270000.0,188685.0,16272.0,157500.0,Commercial associate,10,Other
170655,297780,0,202500.0,194922.0,15214.5,157500.0,Working,10,Transport: type 4
197480,328961,1,166500.0,450000.0,20979.0,450000.0,Working,13,Cleaning
306253,454829,0,157500.0,616923.0,48870.0,558000.0,Working,14,Business Entity Type 3
74503,186395,0,450000.0,1437723.0,76729.5,1372500.0,Commercial associate,16,Industry: type 4

In [9]:
def missing (data):
    missing_number = data.isnull().sum().sort_values(ascending=False)
    missing_percent = ((data.isnull().sum()/data.isnull().count())*100).sort_values(ascending=False)
    missing_values = pd.concat([missing_number, missing_percent], axis=1, keys=['Missing_Number', 'Missing_Percent'])
    return missing_values

In [11]:
missing(data)

                         Missing_Number  Missing_Percent
AMT_GOODS_PRICE                      10             0.10
AMT_ANNUITY                           1             0.01
SK_ID_CURR                            0             0.00
TARGET                                0             0.00
AMT_INCOME_TOTAL                      0             0.00
AMT_CREDIT                            0             0.00
NAME_INCOME_TYPE                      0             0.00
HOUR_APPR_PROCESS_START               0             0.00
ORGANIZATION_TYPE                     0             0.00

In [12]:
#fill null values with mean,median ,mode
for i in data.columns:
    if data[i].dtypes == 'object':
        data[i].fillna(data[i].mode()[0], inplace=True)
    else:
        data[i].fillna(data[i].median(), inplace=True)
print(data)

        SK_ID_CURR  TARGET  AMT_INCOME_TOTAL  AMT_CREDIT  AMT_ANNUITY  \
151508      275620       0          270000.0    188685.0      16272.0
170655      297780       0          202500.0    194922.0      15214.5
197480      328961       1          166500.0    450000.0      20979.0
306253      454829       0          157500.0    616923.0      48870.0
74503       186395       0          450000.0   1437723.0      76729.5
...            ...     ...               ...         ...          ...
114505      232780       1          157500.0   1345500.0      39339.0
259640      400470       0          171000.0   1350000.0      36333.0
141987      264630       0          202500.0   1012653.0      41922.0
176126      304087       0          157500.0    936000.0      25870.5
293601      440150       0          225000.0   1129500.0      44923.5

        AMT_GOODS_PRICE      NAME_INCOME_TYPE  HOUR_APPR_PROCESS_START  \
151508         157500.0  Commercial associate                       10
170655         157500.0               Working                       10
197480         450000.0               Working                       13
306253         558000.0               Working                       14
74503         1372500.0  Commercial associate                       16
...                 ...                   ...                      ...
114505        1345500.0  Commercial associate                       13
259640        1350000.0               Working                       10
141987         931500.0             Pensioner                       12
176126         936000.0  Commercial associate                       18
293601        1129500.0  Commercial associate                       10

             ORGANIZATION_TYPE
151508                   Other
170655       Transport: type 4
197480                Cleaning
306253  Business Entity Type 3
74503         Industry: type 4
...                        ...
114505  Business Entity Type 3
259640       Industry: type 11
141987                     XNA
176126  Business Entity Type 3
293601           Self-employed

[10000 rows x 9 columns]

In [13]:
data.isnull().sum()

SK_ID_CURR                 0
TARGET                     0
AMT_INCOME_TOTAL           0
AMT_CREDIT                 0
AMT_ANNUITY                0
AMT_GOODS_PRICE            0
NAME_INCOME_TYPE           0
HOUR_APPR_PROCESS_START    0
ORGANIZATION_TYPE          0
dtype: int64

In [14]:
# finding numerical data and categorical data in dataset
numerical= data.drop(['TARGET'], axis=1).select_dtypes('number').columns

categorical = data.select_dtypes('object').columns

print(f'Numerical Columns:  {data[numerical].columns}')
print('\n')
print(f'Categorical Columns: {data[categorical].columns}')

Numerical Columns:  Index(['SK_ID_CURR', 'AMT_INCOME_TOTAL', 'AMT_CREDIT', 'AMT_ANNUITY',
       'AMT_GOODS_PRICE', 'HOUR_APPR_PROCESS_START'],
      dtype='object')


Categorical Columns: Index(['NAME_INCOME_TYPE', 'ORGANIZATION_TYPE'], dtype='object')

In [15]:
# Import label encoder
from sklearn import preprocessing

# label_encoder object knows how to understand word labels.
label_encoder = preprocessing.LabelEncoder()

# Encode labels in column 'species'.
data['NAME_INCOME_TYPE']= label_encoder.fit_transform(data['NAME_INCOME_TYPE'])

data['NAME_INCOME_TYPE']

151508    0
170655    4
197480    4
306253    4
74503     0
         ..
114505    0
259640    4
141987    1
176126    0
293601    0
Name: NAME_INCOME_TYPE, Length: 10000, dtype: int32

In [17]:
# Encode labels in column 'species'.
data['ORGANIZATION_TYPE']= label_encoder.fit_transform(data['ORGANIZATION_TYPE'])

data['ORGANIZATION_TYPE']

151508    33
170655    54
197480     6
306253     5
74503     21
          ..
114505     5
259640    16
141987    56
176126     5
293601    42
Name: ORGANIZATION_TYPE, Length: 10000, dtype: int32

In [18]:
X = data.drop("TARGET",axis=1)
y = data.TARGET

In [19]:
from sklearn.model_selection import train_test_split 
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.3,random_state=1)

X_train.shape,X_test.shape

((7000, 8), (3000, 8))

In [21]:
# Applying random forest Classifier
from sklearn.ensemble import RandomForestClassifier
rf_Classifier = RandomForestClassifier(n_estimators = 10, random_state = 0)
rf_Classifier.fit(X_train, y_train)

RandomForestClassifier(n_estimators=10, random_state=0)

In [22]:
y_pred = rf_Classifier.predict(X_test)
y_pred

array([0, 0, 0, ..., 0, 0, 0], dtype=int64)

In [23]:
from sklearn.metrics import  confusion_matrix,accuracy_score
cm=confusion_matrix(y_test,y_pred)
print(cm)
accuracy_score(y_test,y_pred)

[[2783    9]
 [ 208    0]]

0.9276666666666666

In [24]:
# Classification Report
from sklearn.metrics import classification_report
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           0       0.93      1.00      0.96      2792
           1       0.00      0.00      0.00       208

    accuracy                           0.93      3000
   macro avg       0.47      0.50      0.48      3000
weighted avg       0.87      0.93      0.90      3000

In [26]:
import pickle

with open('model-0.1.0.pkl', 'wb') as f: 
    pickle.dump(rf_Classifier, f)

In [29]:
X_train.columns

Index(['SK_ID_CURR', 'AMT_INCOME_TOTAL', 'AMT_CREDIT', 'AMT_ANNUITY',
       'AMT_GOODS_PRICE', 'NAME_INCOME_TYPE', 'HOUR_APPR_PROCESS_START',
       'ORGANIZATION_TYPE'],
      dtype='object')

In [30]:
X_train.head()

,SK_ID_CURR,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,AMT_GOODS_PRICE,NAME_INCOME_TYPE,HOUR_APPR_PROCESS_START,ORGANIZATION_TYPE
91661,206446,180000.0,850536.0,43555.5,747000.0,0,16,3
224308,359805,130500.0,273636.0,27193.5,247500.0,1,11,56
108956,226373,126000.0,423000.0,12253.5,423000.0,0,10,5
49668,157495,225000.0,1007352.0,33421.5,765000.0,0,9,3
35224,140805,108000.0,360000.0,28440.0,360000.0,4,13,30

In [34]:
testdata=pd.read_csv('application_data.csv')
testdata=testdata.sample(10000)
testdata.shape

(10000, 122)

In [35]:
testdata.to_csv('testdata.csv', index=False)

In [2]:
import pandas as pd 
df = pd.read_csv('application_data.csv')
df.shape

(307511, 122)